jcmaxx33/jcmaxx33-mr.Li/jcmaxx33-mr.Li.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32F1
ProjectManager.MainLocation=Core/Src
RCC.MCOFreq_Value=24000000
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32F100C8Tx
SPI2.VirtualType=VM_MASTER
USART1.BaudRate=9600
RCC.PLLCLKFreq_Value=24000000
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-SystemClock_Config-RCC-false-HAL-false,3-MX_DAC_Init-DAC-false-HAL-true,4-MX_SPI2_Init-SPI2-false-HAL-true,5-MX_TIM1_Init-TIM1-false-HAL-true,6-MX_USART1_UART_Init-USART1-false-HAL-true
RCC.ADCFreqValue=12000000
SH.S_TIM1_CH1.ConfNb=1
USART1.IPParameters=VirtualMode,BaudRate
PB11.Signal=GPIO_Input
PB13.Signal=SPI2_SCK
PB15.Signal=SPI2_MOSI
PinOutPanel.RotationAngle=0
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
ProjectManager.StackSize=0x400
SH.COMP_DAC2_group.0=DAC_OUT2,DAC_OUT2
Mcu.IP4=SPI2
RCC.FCLKCortexFreq_Value=24000000
Mcu.IP5=SYS
Mcu.IP2=NVIC
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:false\:false\:false\:false
Mcu.IP3=RCC
Mcu.IP0=DAC
PA12.Locked=true
Mcu.IP1=FREERTOS
PA12.Signal=GPIO_Output
Mcu.UserConstants=
Mcu.ThirdPartyNb=0
RCC.HCLKFreq_Value=24000000
Mcu.IPNb=8
ProjectManager.PreviousToolchain=
RCC.APB2TimFreq_Value=24000000
Mcu.Pin6=PA5
VP_TIM1_VS_ControllerModeClock.Signal=TIM1_VS_ControllerModeClock
Mcu.Pin7=PA6
Mcu.Pin8=PA7
Mcu.Pin9=PB0
FREERTOS.IPParameters=Tasks01,configUSE_RECURSIVE_MUTEXES,configUSE_TICK_HOOK,INCLUDE_xQueueGetMutexHolder,FootprintOK
RCC.AHBFreq_Value=24000000
Mcu.Pin0=PD0-OSC_IN
Mcu.Pin1=PA0-WKUP
GPIO.groupedBy=
Mcu.Pin2=PA1
Mcu.Pin3=PA2
Mcu.Pin4=PA3
Mcu.Pin5=PA4
ProjectManager.ProjectBuild=false
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
PB2.Signal=GPIO_Input
PB3.Mode=JTAG_4_pins
PA8.Locked=true
PA4.Locked=true
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:false\:false\:false\:false
PA15.Mode=JTAG_4_pins
RCC.PLLMUL=RCC_PLL_MUL6
ProjectManager.FirmwarePackage=STM32Cube FW_F1 V1.8.0
MxDb.Version=DB.6.0.0
VP_TIM1_VS_ControllerModeClock.Mode=Clock Mode
ProjectManager.BackupPrevious=false
FREERTOS.INCLUDE_xQueueGetMutexHolder=1
VP_SYS_VS_tim2.Signal=SYS_VS_tim2
PA14.Mode=JTAG_4_pins
PB14.Mode=Full_Duplex_Master
NVIC.TIM2_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true
File.Version=6
SPI2.CalculateBaudRate=12.0 MBits/s
PB8.Locked=true
PA8.Signal=S_TIM1_CH1
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:false\:false\:false\:false
VP_FREERTOS_VS_CMSIS_V1.Mode=CMSIS_V1
ProjectManager.HalAssertFull=false
PB0.Locked=true
ProjectManager.ProjectName=jcmaxx33-mr.Li
RCC.PLLMCOFreq_Value=12000000
Mcu.Package=LQFP48
PB9.Signal=GPIO_Input
VP_SYS_VS_tim2.Mode=TIM2
PA6.Signal=GPIO_Output
PB1.Signal=GPIO_Output
PA7.Locked=true
PA5.Locked=true
NVIC.TimeBase=TIM2_IRQn
SPI2.Mode=SPI_MODE_MASTER
SH.COMP_DAC1_group.ConfNb=1
ProjectManager.ToolChainLocation=
NVIC.TimeBaseIP=TIM2
PA10.Signal=USART1_RX
FREERTOS.FootprintOK=true
PA15.Signal=SYS_JTDI
RCC.APB1TimFreq_Value=24000000
FREERTOS.configUSE_TICK_HOOK=1
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
SPI2.Direction=SPI_DIRECTION_2LINES
PB13.Mode=Full_Duplex_Master
ProjectManager.CustomerFirmwarePackage=
PB15.Locked=true
PB3.Locked=true
PA3.Signal=GPIO_Output
PA2.Locked=true
SH.COMP_DAC2_group.ConfNb=1
SH.COMP_DAC1_group.0=DAC_OUT1,DAC_OUT1
ProjectManager.ProjectFileName=jcmaxx33-mr.Li.ioc
FREERTOS.Tasks01=defaultTask,0,128,StartDefaultTask,Default,NULL,Dynamic,NULL,NULL;thread_user_tas,0,128,StartTask02thread,Default,NULL,Dynamic,NULL,NULL
PA10.Mode=Asynchronous
Mcu.PinsNb=31
ProjectManager.NoMain=false
NVIC.SavedSvcallIrqHandlerGenerated=true
ProjectManager.DefaultFWLocation=true
PD0-OSC_IN.Signal=GPIO_Output
ProjectManager.DeletePrevious=true
PB14.Locked=true
PB10.Locked=true
RCC.FamilyName=M
PA0-WKUP.Signal=GPIO_Output
PA0-WKUP.Locked=true
PA13.Signal=SYS_JTMS-SWDIO
VP_FREERTOS_VS_CMSIS_V1.Signal=FREERTOS_VS_CMSIS_V1
PA15.Locked=true
PA11.Locked=true
PA9.Mode=Asynchronous
SH.S_TIM1_CH1.0=TIM1_CH1,TriggerSource_TI1ED
ProjectManager.TargetToolchain=MDK-ARM V5
PA9.Signal=USART1_TX
PB9.Locked=true
SPI2.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate
ProjectManager.RegisterCallBack=
PA1.Signal=GPIO_Output
PB1.Locked=true
PB10.Signal=GPIO_Input
PB14.Signal=SPI2_MISO
PA5.Signal=COMP_DAC2_group
board=custom
ProjectManager.LastFirmware=true
PB15.Mode=Full_Duplex_Master
NVIC.SavedSystickIrqHandlerGenerated=true
RCC.APB2Freq_Value=24000000
MxCube.Version=6.0.0
Mcu.Pin30=VP_TIM1_VS_ControllerModeClock
PA9.Locked=true
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
PA13.Mode=JTAG_4_pins
ProjectManager.FreePins=false
RCC.IPParameters=ADCFreqValue,AHBFreq_Value,APB1Freq_Value,APB1TimFreq_Value,APB2Freq_Value,APB2TimFreq_Value,FCLKCortexFreq_Value,FamilyName,HCLKFreq_Value,MCOFreq_Value,PLLCLKFreq_Value,PLLMCOFreq_Value,PLLMUL,SYSCLKFreq_VALUE,SYSCLKSource,TimSysFreq_Value
ProjectManager.AskForMigrate=true
Mcu.Name=STM32F100C(8-B)Tx
Mcu.Pin26=PB8
Mcu.Pin27=PB9
NVIC.SavedPendsvIrqHandlerGenerated=true
Mcu.Pin24=PA15
PA2.Signal=GPIO_Output
ProjectManager.UnderRoot=false
Mcu.Pin25=PB3
PB2.Locked=true
Mcu.Pin28=VP_FREERTOS_VS_CMSIS_V1
Mcu.IP6=TIM1
Mcu.Pin29=VP_SYS_VS_tim2
Mcu.IP7=USART1
ProjectManager.CoupleFile=false
PB3.Signal=SYS_JTDO-TRACESWO
PA4.Signal=COMP_DAC1_group
RCC.SYSCLKFreq_VALUE=24000000
Mcu.Pin22=PA13
Mcu.Pin23=PA14
RCC.TimSysFreq_Value=24000000
PA1.Locked=true
Mcu.Pin20=PA11
Mcu.Pin21=PA12
PA3.Locked=true
PA10.Locked=true
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=false
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
PA13.Locked=true
USART1.VirtualMode=VM_ASYNC
ProjectManager.CompilerOptimize=6
PA11.Signal=GPIO_Output
PA14.Signal=SYS_JTCK-SWCLK
ProjectManager.HeapSize=0x200
Mcu.Pin15=PB14
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
Mcu.Pin16=PB15
Mcu.Pin13=PB11
Mcu.Pin14=PB13
FREERTOS.configUSE_RECURSIVE_MUTEXES=1
Mcu.Pin19=PA10
ProjectManager.ComputerToolchain=false
Mcu.Pin17=PA8
Mcu.Pin18=PA9
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
Mcu.Pin11=PB2
Mcu.Pin12=PB10
Mcu.Pin10=PB1
PB8.Signal=GPIO_Input
RCC.APB1Freq_Value=24000000
PB0.Signal=GPIO_Output
PD0-OSC_IN.Locked=true
PB11.Locked=true
ProjectManager.DeviceId=STM32F100C8Tx
ProjectManager.LibraryCopy=0
PA7.Signal=GPIO_Output
PA6.Locked=true
